# 1412. Find the Quiet Students in All Exams
[問題](https://leetcode.com/problems/find-the-quiet-students-in-all-exams/description/?envType=study-plan-v2&envId=premium-sql-50)

## 解答の方針
exam_idでグルーピングして、max()でもmin()でもないレコードを抽出する。

In [1]:
import pandas as pd

In [2]:
data = [[1, 'Daniel'], [2, 'Jade'], [3, 'Stella'], [4, 'Jonathan'], [5, 'Will']]
student = pd.DataFrame(data, columns=['student_id', 'student_name']).astype({'student_id':'Int64', 'student_name':'object'})
data = [[10, 1, 70], [10, 2, 80], [10, 3, 90], [20, 1, 80], [30, 1, 70], [30, 3, 80], [30, 4, 90], [40, 1, 60], [40, 2, 70], [40, 4, 80]]
exam = pd.DataFrame(data, columns=['exam_id', 'student_id', 'score']).astype({'exam_id':'Int64', 'student_id':'Int64', 'score':'Int64'})

In [33]:
student

   student_id student_name
0           1       Daniel
1           2         Jade
2           3       Stella
3           4     Jonathan
4           5         Will

In [34]:
exam

   exam_id  student_id  score
0       10           1     70
1       10           2     80
2       10           3     90
3       20           1     80
4       30           1     70
5       30           3     80
6       30           4     90
7       40           1     60
8       40           2     70
9       40           4     80

In [37]:
def find_quiet_students(student: pd.DataFrame, exam: pd.DataFrame) -> pd.DataFrame:
    mid_scored = exam.groupby("exam_id").apply(lambda x: x[(x.score != x.score.max()) & (x.score != x.score.min())]).reset_index(drop=True)
    highest_or_lowest_scored = exam.groupby("exam_id").apply(lambda x: x[(x.score == x.score.max()) | (x.score == x.score.min())]).reset_index(drop=True)
    result = mid_scored[~mid_scored["student_id"].isin(highest_or_lowest_scored["student_id"])]
    result = result.drop_duplicates("student_id")
    result = result.merge(student, on="student_id")
    result = result.sort_values(by="student_id")
    return result[["student_id", "student_name"]]

In [38]:
find_quiet_students(student, exam)

C:\Users\takuya kinoshita\AppData\Local\Temp\ipykernel_18480\1971872406.py:2: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  mid_scored = exam.groupby("exam_id").apply(lambda x: x[(x.score != x.score.max()) & (x.score != x.score.min())]).reset_index(drop=True)
C:\Users\takuya kinoshita\AppData\Local\Temp\ipykernel_18480\1971872406.py:3: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  highest_or_lowest_scored = exam.groupby("exam_id").apply(lambda x: x[(x.score == x.score.max()) | (x.score == x.score.min())]).reset_index(drop=True)

   student_id student_name
0           2         Jade

## Test scripts

In [14]:
mid_scored = exam.groupby("exam_id").apply(lambda x: x[(x.score != x.score.max()) & (x.score != x.score.min())])

C:\Users\takuya kinoshita\AppData\Local\Temp\ipykernel_18480\3049557627.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  mid_scored = exam.groupby("exam_id").apply(lambda x: x[(x.score != x.score.max()) & (x.score != x.score.min())])

In [15]:
mid_scored

           exam_id  student_id  score
exam_id
10      1       10           2     80
30      5       30           3     80
40      8       40           2     70

In [19]:
mid_scored = mid_scored.reset_index(drop=True)

In [20]:
mid_scored

   exam_id  student_id  score
0       10           2     80
1       30           3     80
2       40           2     70

In [17]:
highest_or_lowest_scored = exam.groupby("exam_id").apply(lambda x: x[(x.score == x.score.max()) | (x.score == x.score.min())])

C:\Users\takuya kinoshita\AppData\Local\Temp\ipykernel_18480\3249306528.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  highest_or_lowest_scored = exam.groupby("exam_id").apply(lambda x: x[(x.score == x.score.max()) | (x.score == x.score.min())])

In [18]:
highest_or_lowest_scored

           exam_id  student_id  score
exam_id
10      0       10           1     70
        2       10           3     90
20      3       20           1     80
30      4       30           1     70
        6       30           4     90
40      7       40           1     60
        9       40           4     80

In [21]:
highest_or_lowest_scored = highest_or_lowest_scored.reset_index(drop=True)

In [24]:
result = mid_scored[~mid_scored["student_id"].isin(highest_or_lowest_scored["student_id"])]

In [26]:
result = result.drop_duplicates("student_id")

In [27]:
result

   exam_id  student_id  score
0       10           2     80

In [28]:
result = result.merge(student, on="student_id")

In [29]:
result[["student_id", "student_name"]]

   student_id student_name
0           2         Jade